[
  {
    "start": 0.000000,
    "end": 114.017462,
    "speaker": "speaker1",
    "text": "does happen people use friends email ID, brother, sisters email ID, so on, that's, please don't do that, please use your own email ID. Then there are several questions about why did I get so many marks, there are specific course related questions. Unfortunately, this is not the forum for us to be able to answer the course related questions. You can definitely ask those course course related questions on before itself. Yeah, so this we won't be able to take those questions up here. So there is one question which is a little bit more generic. What do I need to do? Although this was asked in context of maybe one or two specific courses, but what do I need to clear the final exam? Do is it sufficient to do just the videos and the assignments?"
  },
  {
    "start": 114.128503,
    "end": 114.705919,
    "speaker": "speaker2",
    "text": "My take on this as a teacher as well as,"
  },
  {
    "start": 114.705919,
    "end": 116.971167,
    "speaker": "speaker1",
    "text": "you know, someone who's been in this profession for several years is learning as a continuous process, assessments and assignments are the ones that are really in the world course. So you view the lectures regularly, do the assignments on your own."
  },
  {
    "start": 116.971167,
    "end": 118.037166,
    "speaker": "speaker2",
    "text": "That actually prepares you not just for the exam,"
  },
  {
    "start": 118.037166,
    "end": 197.964872,
    "speaker": "speaker1",
    "text": "but also for the future where your future is related, if your future job is related to the content material of that particular course. So taking looking at the videos sincerely, doing the assignments at a regular interval and revising them before the exam is a recipe for success, not necessarily just for the exam, but for future is one. Yep, the other is when is the next set of courses going to come? The next set of courses will be for the January semester. So the list of courses should be going up. So the site already on the site. I think the first enrollment. Enrollments will open by December 1st. What happens during semester breaks? During semester breaks, we are actually very busy. In the end, Peter Losses taking care of all the back office requirements in order to ensure that all your certificates, online certificates, all your gradings, all of that is completed on time. With good quality, as well as we get ready for the next semester. As a result of that, it's very difficult for us to have courses during semester breaks. But for some of the courses, what does happen during semester break is top scores or very good performers in that course, sometimes get an opportunity to visit a wet lab or a physical lab in the University of the course instructor. And the course instructor will go over five or six experiments in a couple of weeks, weeks speed. So that does happen. It is a very small component at this stage. In Enfital, we are looking forward to how we can expand that so that that becomes useful for all of it. But again, I mean, at Enfital, in the back side, we are pretty much working the entire even though this semester runs twice every year."
  },
  {
    "start": 197.964872,
    "end": 467.973500,
    "speaker": "speaker3",
    "text": "There was some question on the credits on the certificate. I think it's actually been answered on the chat, but I just wanted to add that we recommend certain credits for course of different durations. So we give us a small range. Also there, we don't specifically say that it is only three credits, only two credits. We give a little range so that the university can your respective universities or colleges can make a judgment on how this course aligns with the grid system that they are following. So they can accordingly make some modifications and then put it into your grade sheet if they are taking no credit transfer for that particular course. So that is something that you should just look at. So but we do mention for every course. There is a other thing on the rear side of the certificate. You will have those details available. So that was one. And I think there are still questions on the domain. Yes, we are, like I said, for every discipline, we are starting something called a domain. And all those details will be out fairly soon. So if you are, and again, there is no restriction on who can get certified on a domain. It is the same NPTEL process. Everything is open to everybody. So you could be doing civil engineering. If you want a domain certificate in aerospace, you can do that. You could be doing ocean engineering. You want something from computer science. You can do that. And so on, it is simply a collection of courses that logically fit together and you should be of the order of say six courses which will fit together. And so typically, if you are based on the domain, maybe in two semesters or certainly in three semesters, you can get a domain certificate based on those set of courses. We are still, you know, populating those courses, making sure we have all those courses available, getting our faculty to get those missing courses ready. And so it will get released in a face manner. But we expect that it will be of much greater utility for anybody in that area. It also gives you no much more confidence because you manage to clear some package of courses in the area. And here we are not simply looking for a 40% pass criteria to get the domain certificate. You can get individual course certificates for all of those six courses by just clearing your 40% cutoffs. But to get the domain certificate, we will expect a higher performance. And then which basically means that you are quite good in that area. So that is the point we wanted to convey. I also wanted to add that, you know, since I mentioned this 40% cutoff, that in the last semester or two, we have, you know, upgraded our pass criteria. Previously, you could get an overall 40% and that would help you clear a course. Now we are expecting that you would get 40% both in the assignment as well as independently get a 40% and the final exam. And only then you get the certificate. For us as a proscenicate, we want the whole learning process to happen. We are not focused simply on the final examination. So there are other, you know, online course providers internationally who don't have any final exam. They only do the assignment part, which you are doing here. And then we have no idea who did the assignment or how the assignment was done and so on. And simply on faith they give you the certificate. We feel the assignment part is important. We don't want to get rid of it. We want students to see the content every week and do a weekly participation. Something like attendance in your college, but not really that, it is a more technical attendance so to speak. So we want you to go through that learning process. We are not here simply to certify what you already know. We want you to learn something. So that is why we have some importance for the assignments. And then we also understand that, you know, assignments, we have no way of judging exactly who did it. But, uh, and therefore we have the profit exam and we want to set a minimum bar there also. So it does, it will not help if you have got, you know, somebody has just looked at the difference assignment and, you know, copy-based at everything. And then they are simply unprepared for the fine-vegs and they are not going to get a certificate. So they have to really learn. And like I said, our focus has always been on quality. We want to recognize quality. We want to help, you know, encourage quality and so on. So our certification process will always be focused that way. We will always make changes only in that direction. So we are not very worried on the exact fast percentages and so on and individual courses. Naturally, if we raise the requirements, you may expect some drop in fast percentages. We will always keep you ahead, uh, informed of this ahead of time. So in fact, informed all the colleges, all the SPOCs ahead of time that we are making the change. We, in fact, even showed them, uh, with the,"
  }
]