[
  {
    "start": 0.000000,
    "end": 42.470247,
    "speaker": "speaker1",
    "text": "system. Well, if we talk about the education, then inner education system only two things are missing. First, education and second, a system. When we talk about education system, then a person should have that particular ability to have access to education. But if we talk about the rural areas, then only 27% of people have access to education. When we talk about the 50% students are draw-up out-back class 8's only in our India. When we talk about literacy, then it's just 77.5% and as well, our India has ranked 77nd in the world global ratio in the cognitive development of an individual. More than Switzerland, population, India produced engineers, but still, when it's about the innovation research and all, then Switzerland is on the first rank. Basically, what does it mean? That we are only just delivering our only educating people, but whenever it's about the quality education, then we all are liking it. In India, 83% of educated people are still unemployed. Then it is not only about the school. It is not only about education, but it is also about the employment that they have to get after completing their schools after being graduated person. In UP 2018, 462 post of police messenger only. That was the ability of the eligibility of 50 class passed and only know the cycling. 35,000 of graduates, more than 3,700 PhDs, they all took place, they all just filled the form for that police messenger only. Then we can see the situation and condition of India that they are just behind of government school, they are just behind the government jobs and all, because it is in secure and all. That is the main condition of education system that we all are liking. Even I agree with point, everyone's point. If I"
  },
  {
    "start": 42.553768,
    "end": 124.007275,
    "speaker": "speaker2",
    "text": "talk about more about education systems, I would say that if we ignore some things, we are still focusing on we are still copying or we are just going with the education system by the British. Even as I want to tell you that when British colonized India, they were facing two major problems. That first was the communication with the Indians and second was communication with workers. To solve this particular problem, they come with the English Act 1937, in which they come with the particular thing that English will be taught in the schools. It gives them benefits that they will like Indian people, they can communicate with them also, they can be a worker under the British government. Even I would say that if we talk about some other developing economy like Russia, even France or China, so they do not give too much quality to English. But in India, your English gives you a particular thing that your communication is good or not. That is why we are sitting here, most of us that we are learning English, why? Because in India, English is a reputation language. This is the main problem of education system that we are not able to understand one simple thing, that English is not all about communication. We all have listened that competition is very important so that we can improve ourselves. But healthy competitions. In schools, there are the population of 60 to 70 students in a class, but on those class, on that, the population only 1 or 2 are topers. Why? Let me tell you the reason. As we have different thoughts and mindset, at the same time, we have different way of learning. Like our sense, every person has different sense who has who work in a better way. Suppose my listening is very powerful. His visualization is very powerful. But your reading is very powerful. So that every person sitting here is a different learner. And in exams, only the person who has the better, you can say, memorizing power, be the toper. And that's why we fail in the terms of learner. First of all, if I would talk about Indian education"
  },
  {
    "start": 124.090796,
    "end": 208.049923,
    "speaker": "speaker3",
    "text": "system, then a children from Biber, after two or three years as a pre-joined day school from class nursery to class fifth. After that, the children study from class six to class two-year. And after completing their school in secondary, they complete their graduation in India, most of the common thing with every student or in every family. And after graduation, most of the like students are searching for the job or seeking for the job. But they are not getting what actually they deserve it. Because they are under the, they are in the under employment. And that's the main reason in India is like, as of now, the review is 40% graduating in India is still unemployed. The reason is the schooling and the graduation and the colleges anywhere, the student never get an opportunity to learn any skill. If I compare India with another country, then in China or any other country, US, the student focus on the skill from the day one, starting of your schooling. And they also focus on sports of the students as well. That's a very good thing for that country as well. And it is a lack for the Indian education system. Thank you. As as per the, the points discussed, our education system, mostly our teachers, the, most of our teachers discriminate us on the basis of our marks. If you're a topger, you're treated like a king. If you are average performer, you're not. And you're probably the discrimination has to go because we cannot discriminate our own students when we are wearing uniforms. According to the school, the uniforms are distributed so all of the students can look equal. And there should be no discrimination. That's what the school says. And if you can implement that on the markspea on marks basis, that that would be a great thing."
  },
  {
    "start": 208.216964,
    "end": 266.013250,
    "speaker": "speaker4",
    "text": "Talking about education system, there is two questions which there is a two question which keep wondering in my mind. First is why the passing marks is only 33%. And second, if you got 95, 90% what you will get nothing. At the last after clearing your 12th, you are only having a report card in which you are having a percentage. But with that percentage, you are not getting any employment on anything. Even though now the system has so we see we need and so you have to clarify an entrance exam. So your academic exam having a academic studies having no purpose. And there was a season earlier that during Vimra, Vimra made Karan Swami, we have a time that education is powerful because on that time education having a quality. But right now the baby are studying, there is no quality because every year, CBS here or any board exam, uh, boots are reducing the slabers. And secondly, we have to work upon the skills and quality. And there is no quality in our education system. We are just mugging up the theories and all the things."
  },
  {
    "start": 266.013250,
    "end": 341.975275,
    "speaker": "speaker5",
    "text": "In the very embarkness of the education system, they are various kind of the plans and various various kind of the policies which has been running out in our day-to-day life. The first education policy which has been running it's a plan 3 plus 4 plus 4 plus 2 plus 3. Where we have been running our education system in our schools. But after that, it's just about getting the degree. It's not about getting the new skills. It's not about getting the new job. It's getting the new job. We all have been stuck between our place where we are just running behind the jobs. We are just running beyond particular codes. But the real education system, what it does mean by by your own mindset. If you want to enhance the capability of your mindset, then we must know what is the value of skills, which is not taught in our schools, which is not taught in our education system. There are many of the things which are missed by our policies. There are multiples of the country which has been running in our day-to-day life, which is showing that what is the real power of skills. Just because they're working upon the bees, which is made by your own mindset. We are just different. We are we all are different made up of seven natural elements. That is why we have got the different mindset. But we know what is the real potential and we have got the different different interest. That is why our government need to segregate our work. Just like a one-person having a different interest in drawing. One-person having a different interest in astronomy. They should furnish each one of the student in different manner way. That's how the education policy should be recognized in our day-to-day life."
  },
  {
    "start": 342.058795,
    "end": 383.004791,
    "speaker": "speaker6",
    "text": "Okay, by the education, but we generally learn, being in discipline, being in manner and having etiquette. But these things are taught in the schools. No. In the schools, what are generally taught to us? The reading, the things, writing, the things and mugging up and home work. Simply, this is a whole pattern of the school and I'm sure in the 12 years, 12 to 14 years if you go school. So, no, no, like there's not any one's particular student who know the whole basic etiquette of the life. Still the students throw the garbage on the road. Still they split on the road and they sit there they are having etiquettes. Are these things called etiquettes deflated or not? But in the schools the practical learnings are still not provided. The learning which is just there, that is theory and inתח, right now, most of the schools the labs are not there and we are demanding for the better education, we are demanding for the better future and I'm guaranteed. I can say that in the school, the co-caloo co-caloo co-caloo co-caloo co-caloo as activities are not supported as the studies. As so, that's what that's the reason why there is not that much at least in our India. That's the reason why our India has not won any single gold medal in the Olympics. So, we have to promote these things as well with the education as well. So, we can be a developing country. So, our education is mainly focus on a theoretical knowledge, not on practical knowledge. Our practical knowledge increases the skills which help in the future for finding the jobs. Now, the degree is only a eligibility criteria to form a, to form a, a form of job. To fill a form of job. So, if a person who has skills, he can be a successful or get a proper job in his successful life."
  },
  {
    "start": 383.004791,
    "end": 448.004732,
    "speaker": "speaker7",
    "text": "So, first of all, the Indian education is one of the oldest in the world, with the students studying in Gurukolashrams centuries ago. So, still, there are many students who are not studying. As per my opinion, the education should be free for everyone. So, the government should take some steps like the education should be free for everyone and the slabas. And the slabas and the education slabas is the same for everyone. Now, I will put some points how to improve Indian education system."
  },
  {
    "start": 448.004732,
    "end": 546.976694,
    "speaker": "soeaker8",
    "text": "First point, the teacher education. In most of the village area, the teacher government teachers are not still educated for their own subject. The second point, parent involvement in the student is studying. Because lots of parent, like do their admission for their children, but they did not involve in their school or any parent teacher meeting or anything else. They are just like senders, student to the school and they forget it. So, third point is practical learning. Because as of now, I see there are a lot of children in every school in every private school as my nephew as well. Only making the notes, theoretical notes, drawing and like printing are there, stuff to put in the notebook. So, apart from theory, schools would focus on the practical knowledge as well. Fourth point I will put over here, personalize education. Like the students, like everybody have different mindset. So, teacher have to understand the mindset of the student and according to their mind, they have to guide them and they have to teach them. So, personalize education is most important in Indian education system. Thank you."
  },
  {
    "start": 546.976694,
    "end": 632.188631,
    "speaker": "speaker9",
    "text": "So, you might have talked about lots of things in education system. But one thing I forgot, that is the corruption. The N and R, you have seen in each and every here, the paper has lived. Not a single year, we can say that the paper is not lived. You can say the India is just corrupted a lot. But let us just compare to China. That is also a country, that is our neighbor and published it is also almost same. But the education system of China is very fentabilis. You know how? In China, they take exam in a prison. They take exam in a prison in which there is full of security, full of security even the exam sheets are just travels in a full of bulletproof trunks. So, you can see that how much security it is being given by the China. Then now we have understood education system of India. But it is improving, we cannot neglect this particular thing. See, we have lots of problem in our education system. But still, they are there. Even you can see the new education policy. We are improving. So, means it is a basic thing that if a country wants to develop country, so need to improve its education system. If we will not improve by mind, we cannot go with innovations and all. So, I just want to say that we all hope for the betterment of education system of India and we cannot neglect this particular thing that it is improving. Thank you."
  }
]